================================================================================
Empty Directive
================================================================================

<% %>

--------------------------------------------------------------------------------

(fragment
  (newline)
  (directive)
  (newline))

================================================================================
Directive with just an assign
================================================================================

I am some text!
<%= @x %>
I am more some text!

--------------------------------------------------------------------------------

(fragment
  (newline)
  (text)
  (newline)
  (directive
    (expression))
  (newline)
  (text)
  (newline))

================================================================================
Directive with a conditional block
================================================================================

<%= if @x do %>
Hello, tree-sitter!
<% end %>

--------------------------------------------------------------------------------

(fragment
  (newline)
  (directive
    (partial_expression))
  (newline)
  (text)
  (newline)
  (directive
    (partial_expression))
  (newline))

================================================================================
Directive with multiple case stanzas
================================================================================

<%= case @x do %>
  <% 0 -> %> Zero
  <% func when is_function(func) -> %> Function
  <% _ -> %> Something else...
<% end %>

--------------------------------------------------------------------------------

(fragment
  (newline)
  (directive
    (partial_expression))
  (newline)
  (directive
    (partial_expression))
  (text)
  (newline)
  (directive
    (partial_expression))
  (text)
  (newline)
  (directive
    (partial_expression))
  (text)
  (newline)
  (directive
    (partial_expression))
  (newline))

================================================================================
Directive with parenthesized anonymous function
================================================================================

<%= f = form_for(fn -> %>
  <%= text_input f, :name %>
<% end) %>

--------------------------------------------------------------------------------

(fragment
  (newline)
  (directive
    (partial_expression))
  (newline)
  (directive
    (expression))
  (newline)
  (directive
    (partial_expression))
  (newline))

================================================================================
Directive with unparenthesized anonymous function
================================================================================

<%= f = form_for fn -> %>
  <%= text_input f, :name %>
<% end %>

--------------------------------------------------------------------------------

(fragment
  (newline)
  (directive
    (partial_expression))
  (newline)
  (directive
    (expression))
  (newline)
  (directive
    (partial_expression))
  (newline))

================================================================================
Directive containing an anonymous function is not marked as a partial expression
================================================================================

<%= evens = Enum.filter(@numbers, &Integer.is_even/1) %>

--------------------------------------------------------------------------------

(fragment
  (newline)
  (directive
    (expression))
  (newline))

================================================================================
Directive with partial expression and trailing comment
================================================================================

<%= if @x do # this should always be true %>
  It's true!
<% end %>

--------------------------------------------------------------------------------

(fragment
  (newline)
  (directive
    (partial_expression))
  (newline)
  (text)
  (newline)
  (directive
    (partial_expression))
  (newline))
